vinh107108/amazon-freertos/vendors/renesas/boards/rx65n-rsk/aws_demos/application_code/renesas_code/utility/r_simple_filesystem_on_dataflash.c

/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2020 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/

/* C runtime includes. */
#include <stdio.h>
#include <string.h>

/* Renesas RX platform includes */
#include "platform.h"
#include "r_flash_rx_if.h"
#include "r_simple_filesystem_on_dataflash_if.h"

#if defined USE_MBEDTLS
/* mbedtls */
#include "mbedtls/sha256.h"	/* this will change to Renesas SHA256 library to improve more easy to integrate by using FIT mechanism. */
#elif  defined USE_TINYCRYPT
/* tinycrypt */
#include "tinycrypt/sha256.h"	/* this will change to Renesas SHA256 library to improve more easy to integrate by using FIT mechanism. */
#else
#endif

/* define the word "Simple Filesystem on Dataflash" as "SFD". */
#define SFD_DATA_STATUS_EMPTY 0
#define SFD_DATA_STATUS_REGISTERED 1
#define SFD_DATA_STATUS_HIT 2

#define MAX_CHECK_DATAFLASH_AREA_RETRY_COUNT 3

#if defined (BSP_MCU_RX65N)
#if SFD_CONTROL_BLOCK_SIZE == 1024
#define SFD_CONTROL_BLOCK_INITIAL_DATA \
    {\
        /* uint8_t local_storage[((FLASH_DF_BLOCK_SIZE * FLASH_NUM_BLOCKS_DF) / 4) - (sizeof(SFD_DATA) * SFD_OBJECT_HANDLES_NUM) - SFD_SHA256_LENGTH]; */\
        {0x00},\
        /* SFD_DATA sfd_data[SFD_OBJECT_HANDLES_NUM]; */\
        {0x00},\
    },\
    /* uint8_t hash_sha256[SFD_SHA256_LENGTH]; */\
    {0x5f, 0x51, 0xd9, 0xe5, 0x7c, 0x05, 0x1c, 0xc5, 0x16, 0x38, 0x83, 0x46, 0xd8, 0x60, 0x97, 0x6b, 0xff, 0x35, 0x31, 0xda, 0x95, 0x61, 0xf6, 0x57, 0x0c, 0x19, 0xb2, 0xca, 0x2d, 0xa4, 0x8e, 0xab},
#elif SFD_CONTROL_BLOCK_SIZE == 2048
#define SFD_CONTROL_BLOCK_INITIAL_DATA \
    {\
        /* uint8_t local_storage[((FLASH_DF_BLOCK_SIZE * FLASH_NUM_BLOCKS_DF) / 4) - (sizeof(SFD_DATA) * SFD_OBJECT_HANDLES_NUM) - SFD_SHA256_LENGTH]; */\
        {0x00},\
        /* SFD_DATA sfd_data[SFD_OBJECT_HANDLES_NUM]; */\
        {0x00},\
    },\
    /* uint8_t hash_sha256[SFD_SHA256_LENGTH]; */\
    {0xd2, 0x63, 0xc7, 0xc6, 0x0b, 0x6f, 0x98, 0x06, 0x23, 0x51, 0x0b, 0x23, 0xa0, 0x22, 0x28, 0xfd, 0x66, 0x9b, 0x55, 0x8f, 0x19, 0x57, 0xdb, 0x78, 0x83, 0xb7, 0x06, 0xb2, 0x47, 0x13, 0x3c, 0x92},
#elif SFD_CONTROL_BLOCK_SIZE == 4096
#define SFD_CONTROL_BLOCK_INITIAL_DATA \
    {\
        /* uint8_t local_storage[((FLASH_DF_BLOCK_SIZE * FLASH_NUM_BLOCKS_DF) / 4) - (sizeof(SFD_DATA) * SFD_OBJECT_HANDLES_NUM) - SFD_SHA256_LENGTH]; */\
        {0x00},\
        /* SFD_DATA sfd_data[SFD_OBJECT_HANDLES_NUM]; */\
        {0x00},\
    },\
    /* uint8_t hash_sha256[SFD_SHA256_LENGTH]; */\
    {0x81, 0xac, 0x48, 0xa9, 0xd4, 0xa7, 0x8e, 0xbe, 0xd4, 0x62, 0x83, 0x74, 0x53, 0x9d, 0xbb, 0x2f, 0xc1, 0x63, 0x37, 0x9c, 0x39, 0x40, 0x99, 0x5e, 0x8b, 0x8f, 0x7b, 0x31, 0x61, 0x4b, 0x8c, 0xde},
#elif SFD_CONTROL_BLOCK_SIZE == 6144
#define SFD_CONTROL_BLOCK_INITIAL_DATA \
    {\
        /* uint8_t local_storage[((FLASH_DF_BLOCK_SIZE * FLASH_NUM_BLOCKS_DF) / 4) - (sizeof(SFD_DATA) * SFD_OBJECT_HANDLES_NUM) - SFD_SHA256_LENGTH]; */\
        {0x00},\
        /* SFD_DATA sfd_data[SFD_OBJECT_HANDLES_NUM]; */\
        {0x00},\
    },\
    /* uint8_t hash_sha256[SFD_SHA256_LENGTH]; */\
    {0xc8, 0xf7, 0x33, 0xbf, 0xed, 0xbe, 0x68, 0xe8, 0x3c, 0xd7, 0xb1, 0xa4, 0x29, 0xab, 0x3b, 0x91, 0xaa, 0x26, 0x03, 0xd5, 0x77, 0x2e, 0xd5, 0x75, 0x41, 0x63, 0x90, 0x37, 0x95, 0xe0, 0x7a, 0x9d},
#endif

#else
#error "Simple Filesystem on Dataflash (SFD) does not support your MCU"
#endif

#define SFD_DEBUG_PRINT( X )  /* printf( X ) */

#define SFD_DATA_FLASH_UPDATE_STATE_INITIALIZE 0
#define SFD_DATA_FLASH_UPDATE_STATE_ERASE 1
#define SFD_DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE 2
#define SFD_DATA_FLASH_UPDATE_STATE_WRITE 3
#define SFD_DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE 4
#define SFD_DATA_FLASH_UPDATE_STATE_FINALIZE 5
#define SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED 6
#define SFD_DATA_FLASH_UPDATE_STATE_ERROR 103

typedef struct _pkcs_storage_control_block_sub
{
    uint8_t local_storage[SFD_LOCAL_STORAGE_SIZE];
    SFD_DESCRIPTOR sfd_data[SFD_OBJECT_HANDLES_NUM];
} SFD_STORAGE_CONTROL_BLOCK_SUB;

typedef struct _SFD_CONTROL_BLOCK
{
    SFD_STORAGE_CONTROL_BLOCK_SUB data;
    uint8_t hash_sha256[SFD_SHA256_LENGTH];
} SFD_CONTROL_BLOCK;

static SFD_CONTROL_BLOCK sfd_control_block_data_image;        /* RX72N case: 4KB  */
static int current_handle_index = 0;

R_BSP_ATTRIB_SECTION_CHANGE(C, SFD_SECTION_NAME , 1)
static const SFD_CONTROL_BLOCK sfd_control_block_data = {SFD_CONTROL_BLOCK_INITIAL_DATA};
R_BSP_ATTRIB_SECTION_CHANGE_END

R_BSP_ATTRIB_SECTION_CHANGE(C, SFD_MIRROR_SECTION_NAME , 1)
static const SFD_CONTROL_BLOCK sfd_control_block_data_mirror = {SFD_CONTROL_BLOCK_INITIAL_DATA};
R_BSP_ATTRIB_SECTION_CHANGE_END

static void update_dataflash_data(void);
static void update_dataflash_data_from_image(void);
static void update_dataflash_data_mirror_from_image(void);
static void check_dataflash_area(uint32_t retry_counter);

static void data_flash_update_status_initialize(void);
static void update_data_flash_callback_function(void *event);

typedef struct _update_data_flash_control_block {
	uint32_t status;
}UPDATA_DATA_FLASH_CONTROL_BLOCK;

