vinh107108/amazon-freertos/vendors/renesas/boards/rx65n-rsk/aws_demos/application_code/renesas_code/utility/r_simple_filesystem_on_dataflash.c
/******************************************************************************
 Private global variables
 ******************************************************************************/
static UPDATA_DATA_FLASH_CONTROL_BLOCK update_data_flash_control_block;

sfd_err_t R_SFD_Open(void)
{
	sfd_err_t sfd_err = SFD_FATAL_ERROR;

	if(FLASH_CFG_DATA_FLASH_BGO == 1)
	{
		/* check the hash */
		check_dataflash_area(0);
		/* copy data from storage to ram */
		memcpy(&sfd_control_block_data_image, (void *)&sfd_control_block_data, sizeof(sfd_control_block_data_image));
		sfd_err = SFD_SUCCESS;
	}
	else
	{
		SFD_DEBUG_PRINT("Please set FLASH_CFG_DATA_FLASH_BGO to 1 in r_flash_config_rx.h.\r\n");
		sfd_err = SFD_FATAL_ERROR;
	}
    return sfd_err;
}

SFD_HANDLE R_SFD_SaveObject(uint8_t *label, uint32_t label_length, uint8_t *data, uint32_t data_length)
{
    uint32_t i;
    uint8_t hash_sha256[SFD_SHA256_LENGTH];
    SFD_HANDLE xHandle = SFD_HANDLE_INVALID;

#if defined USE_MBEDTLS
    mbedtls_sha256_context ctx;
#elif  defined USE_TINYCRYPT
    TCSha256State_t s;
    struct tc_sha256_state_struct tc_sha256_state;
    s = &tc_sha256_state;
#endif

#if defined USE_MBEDTLS
    mbedtls_sha256_init(&ctx);
#elif  defined USE_TINYCRYPT
    tc_sha256_init(s);
#endif

    /* check the hash */
    check_dataflash_area(0);

    /* copy data from storage to ram */
    memcpy(&sfd_control_block_data_image, (void *)&sfd_control_block_data, sizeof(sfd_control_block_data_image));

    /* search specified label value from object_handle_dictionary */
    for (i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
    {
        if (!strncmp((char * )&sfd_control_block_data_image.data.sfd_data[i].label, (char * )label, label_length))
        {
            xHandle = i;
        }
    }

    /* pre-calculate -> total stored data size : pre-calculate phase */
    uint32_t total_stored_data_size = 0;

    /* specified label found: overwrite specified data into registered label.  */
    if (xHandle != SFD_HANDLE_INVALID)
    {
        for (int i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
        {
            if (sfd_control_block_data_image.data.sfd_data[i].status == SFD_DATA_STATUS_REGISTERED)
            {
                total_stored_data_size += sfd_control_block_data_image.data.sfd_data[i].data_length;
            }
        }

        /* remove current xHandle from sfd_data */
        if (sfd_control_block_data_image.data.sfd_data[xHandle].status == SFD_DATA_STATUS_REGISTERED)
        {
            uint32_t move_target_xHandle = 0, move_target_index = 0;

            uint32_t delete_target_index = sfd_control_block_data_image.data.sfd_data[xHandle].local_storage_index;
            uint32_t delete_target_data_size = sfd_control_block_data_image.data.sfd_data[xHandle].data_length;

            /* Search move target index and handle  */
            for (int i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
            {
                if ((sfd_control_block_data_image.data.sfd_data[i].status == SFD_DATA_STATUS_REGISTERED)
                        && (sfd_control_block_data_image.data.sfd_data[i].local_storage_index == (delete_target_index + delete_target_data_size)))
                {
                    move_target_xHandle = i;
                    move_target_index = sfd_control_block_data_image.data.sfd_data[i].local_storage_index;
                    break;
                }
            }

            if (move_target_xHandle != 0)
            {
                /* Move target index to delete target index */
                memmove(
                    (void * )&sfd_control_block_data_image.data.local_storage[delete_target_index],
                    (void * )&sfd_control_block_data_image.data.local_storage[move_target_index],
                    (size_t )total_stored_data_size - move_target_index);

                /* Fix index of all moved data  */
                for (int i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
                {
                    if (sfd_control_block_data_image.data.sfd_data[i].local_storage_index > delete_target_index)
                    {
                        sfd_control_block_data_image.data.sfd_data[i].local_storage_index -= delete_target_data_size;
                    }
                }
            }

            /* Recalculate the end of data storage  */
            total_stored_data_size -= delete_target_data_size;

            sfd_control_block_data_image.data.sfd_data[xHandle].local_storage_index = 0;
            sfd_control_block_data_image.data.sfd_data[xHandle].data_length = 0;

        }
    }
	/* specified label not found: add specified data as new label. */
	else
	{
		/* search target blank entry */
        for (int i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
        {
            if (sfd_control_block_data_image.data.sfd_data[i].status == SFD_DATA_STATUS_EMPTY)
            {
                xHandle = i;
            	break;
            }
            else if (sfd_control_block_data_image.data.sfd_data[i].status == SFD_DATA_STATUS_REGISTERED)
            {
                total_stored_data_size += sfd_control_block_data_image.data.sfd_data[i].data_length;
            }
        }
	}

    if(data_length + total_stored_data_size < SFD_LOCAL_STORAGE_SIZE)
    {
		strncpy((char * )sfd_control_block_data_image.data.sfd_data[xHandle].label, (char * )label, SFD_HANDLES_LABEL_MAX_LENGTH);
		sfd_control_block_data_image.data.sfd_data[xHandle].label_length = label_length;
		sfd_control_block_data_image.data.sfd_data[xHandle].local_storage_index = total_stored_data_size;
		sfd_control_block_data_image.data.sfd_data[xHandle].data_length = data_length;
		sfd_control_block_data_image.data.sfd_data[xHandle].status = SFD_DATA_STATUS_REGISTERED;
		sfd_control_block_data_image.data.sfd_data[xHandle].xHandle = xHandle;
		memcpy(&sfd_control_block_data_image.data.local_storage[total_stored_data_size], data, data_length);

		/* update dataflash data */
		update_dataflash_data();
    }
    else
    {
    	xHandle = SFD_HANDLE_INVALID;
    }

