vinh107108/amazon-freertos/vendors/renesas/boards/rx65n-rsk/aws_demos/application_code/renesas_code/utility/r_simple_filesystem_on_dataflash.c
    return xHandle;

}

sfd_err_t R_SFD_Close(void)
{
	/* nothing to do */
    return SFD_SUCCESS;
}

SFD_HANDLE R_SFD_FindObject( uint8_t *label, uint8_t label_length )
{
	SFD_HANDLE xHandle = SFD_HANDLE_INVALID;
    int i;

    /* copy data from storage to ram */
    memcpy(&sfd_control_block_data_image, (void *)&sfd_control_block_data, sizeof(sfd_control_block_data_image));

    for(i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
    {
        if(!strncmp((char *)&sfd_control_block_data_image.data.sfd_data[i].label, (char *)label, label_length))
        {
            if(sfd_control_block_data_image.data.sfd_data[i].status == SFD_DATA_STATUS_REGISTERED)
            {
                xHandle = i;
            }
        }
    }
    return xHandle;
}

sfd_err_t R_SFD_GetObjectValue( SFD_HANDLE xHandle,
                                 uint8_t **data,
                                 uint32_t *data_length)
{
	sfd_err_t xReturn = SFD_FATAL_ERROR;

    /* copy data from storage to ram */
    memcpy(&sfd_control_block_data_image, (void *)&sfd_control_block_data, sizeof(sfd_control_block_data_image));

    if (xHandle != SFD_HANDLE_INVALID)
    {
        *data = &sfd_control_block_data_image.data.local_storage[sfd_control_block_data_image.data.sfd_data[xHandle].local_storage_index];
        *data_length = sfd_control_block_data_image.data.sfd_data[xHandle].data_length;
        xReturn = SFD_SUCCESS;
    }
    return xReturn;
}

sfd_err_t R_SFD_Scan(uint8_t **label, uint32_t *label_length, uint8_t **data, uint32_t *data_length)
{
	int i;
	sfd_err_t xReturn = SFD_FATAL_ERROR;

    /* copy data from storage to ram */
    memcpy(&sfd_control_block_data_image, (void *)&sfd_control_block_data, sizeof(sfd_control_block_data_image));

	if(current_handle_index == -1)
	{
		xReturn = SFD_END_OF_LIST;
	}
	else
	{
		while(1)
		{
			if(sfd_control_block_data_image.data.sfd_data[current_handle_index].status == SFD_DATA_STATUS_REGISTERED)
			{
				*label = &sfd_control_block_data_image.data.sfd_data[current_handle_index].label;
				*label_length = sfd_control_block_data_image.data.sfd_data[current_handle_index].label_length;
				*data = &sfd_control_block_data_image.data.local_storage[sfd_control_block_data_image.data.sfd_data[current_handle_index].local_storage_index];
				*data_length = sfd_control_block_data_image.data.sfd_data[current_handle_index].data_length;
				current_handle_index++;
				xReturn = SFD_SUCCESS;
				break;
			}
			else
			{
				current_handle_index++;
			}
			if(current_handle_index == SFD_OBJECT_HANDLES_NUM)
			{
				current_handle_index = -1;
				break;
			}
		}
	}

	return xReturn;
}

sfd_err_t R_SFD_ResetScan(void)
{
	current_handle_index = 0;
	return SFD_SUCCESS;
}

sfd_err_t R_SFD_EraseAll(void)
{
	sfd_err_t xReturn = SFD_FATAL_ERROR;

    /* copy data from storage to ram */
    memcpy(&sfd_control_block_data_image, (void *)&sfd_control_block_data, sizeof(sfd_control_block_data_image));

    for (int i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
    {
    	sfd_control_block_data_image.data.sfd_data[i].data_length = 0;
    	memset(sfd_control_block_data_image.data.sfd_data[i].label, 0, sizeof(sfd_control_block_data_image.data.sfd_data[i].label));
    	sfd_control_block_data_image.data.sfd_data[i].label_length = 0;
    	sfd_control_block_data_image.data.sfd_data[i].local_storage_index = 0;
    	sfd_control_block_data_image.data.sfd_data[i].status = SFD_DATA_STATUS_EMPTY;
    	sfd_control_block_data_image.data.sfd_data[i].xHandle = 0;
    }
	/* update dataflash data */
	update_dataflash_data();
}

uint32_t R_SFD_ReadPysicalSize(void)
{
	return (FLASH_DF_BLOCK_SIZE * FLASH_NUM_BLOCKS_DF);
}

uint32_t R_SFD_ReadAllocatedStorageSize(void)
{
	return SFD_LOCAL_STORAGE_SIZE;
}

uint32_t R_SFD_ReadFreeSize(void)
{
	SFD_HANDLE xHandle = SFD_HANDLE_INVALID;
    int i;
    uint32_t total_size = 0;

    /* copy data from storage to ram */
    memcpy(&sfd_control_block_data_image, (void *)&sfd_control_block_data, sizeof(sfd_control_block_data_image));

    for(i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
    {
    	total_size += sfd_control_block_data_image.data.sfd_data[i].data_length;
    }

	return (SFD_LOCAL_STORAGE_SIZE - total_size);
}

static void update_dataflash_data(void)
{
    uint8_t hash_sha256[SFD_SHA256_LENGTH];
#if defined USE_MBEDTLS
    mbedtls_sha256_context ctx;
#elif  defined USE_TINYCRYPT
    TCSha256State_t s;
    struct tc_sha256_state_struct tc_sha256_state;
    s = &tc_sha256_state;
#endif

#if defined USE_MBEDTLS
    mbedtls_sha256_init(&ctx);
#elif  defined USE_TINYCRYPT
    tc_sha256_init(s);
#endif

	/* update the hash */
#if defined USE_MBEDTLS
	mbedtls_sha256_starts_ret(&ctx, 0); /* 0 means SHA256 context */
	mbedtls_sha256_update_ret(&ctx, (unsigned char *)&sfd_control_block_data_image.data, sizeof(sfd_control_block_data.data));
	mbedtls_sha256_finish_ret(&ctx, hash_sha256);
#elif  defined USE_TINYCRYPT
	tc_sha256_init(s);
	tc_sha256_update(s, (unsigned char *)&sfd_control_block_data_image.data, sizeof(sfd_control_block_data.data));
	tc_sha256_final(hash_sha256, s);
#endif
	memcpy(sfd_control_block_data_image.hash_sha256, hash_sha256, sizeof(hash_sha256));

	/* update data from ram to storage */
	data_flash_update_status_initialize();
	while ( update_data_flash_control_block.status < SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED )
	{
		update_dataflash_data_from_image();
	}
	if (update_data_flash_control_block.status == SFD_DATA_FLASH_UPDATE_STATE_ERROR)
	{
		SFD_DEBUG_PRINT(("ERROR: Update data flash data from image\r\n"));
		while(1);
	}
	data_flash_update_status_initialize();
	while ( update_data_flash_control_block.status < SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED )
	{
		update_dataflash_data_mirror_from_image();
	}
	if (update_data_flash_control_block.status == SFD_DATA_FLASH_UPDATE_STATE_ERROR)
	{
		SFD_DEBUG_PRINT(("ERROR: Update data flash data mirror from image\r\n"));
		while(1);
	}
}

static void update_dataflash_data_from_image(void)
{
	flash_interrupt_config_t cb_func_info;
    static uint32_t required_dataflash_block_num;
    flash_err_t flash_error_code = FLASH_SUCCESS;

    switch(update_data_flash_control_block.status)
    {
        case SFD_DATA_FLASH_UPDATE_STATE_INITIALIZE: /* initialize */
        	cb_func_info.pcallback = update_data_flash_callback_function;
        	cb_func_info.int_priority = 15;
        	R_FLASH_Control(FLASH_CMD_SET_BGO_CALLBACK, (void *)&cb_func_info);
            required_dataflash_block_num = sizeof(SFD_CONTROL_BLOCK) / FLASH_DF_BLOCK_SIZE;
            if(sizeof(SFD_CONTROL_BLOCK) % FLASH_DF_BLOCK_SIZE)
            {
                required_dataflash_block_num++;
            }
            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_ERASE;
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_ERASE:
            SFD_DEBUG_PRINT(("erase dataflash(main)..."));
            R_BSP_InterruptsDisable();
            flash_error_code = R_FLASH_Erase((flash_block_address_t)&sfd_control_block_data, required_dataflash_block_num);
            R_BSP_InterruptsEnable();
            if(FLASH_SUCCESS == flash_error_code)
            {
                 SFD_DEBUG_PRINT(("OK\r\n"));
            }
            else
            {
                SFD_DEBUG_PRINT(("NG\r\n"));
                SFD_DEBUG_PRINT(("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code));
            }
            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE;
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_WRITE:
            SFD_DEBUG_PRINT(("write dataflash(main)..."));
            R_BSP_InterruptsDisable();
            flash_error_code = R_FLASH_Write((flash_block_address_t)&sfd_control_block_data_image, (flash_block_address_t)&sfd_control_block_data, FLASH_DF_BLOCK_SIZE * required_dataflash_block_num);
            R_BSP_InterruptsEnable();
            if(FLASH_SUCCESS == flash_error_code)
            {
                SFD_DEBUG_PRINT(("OK\r\n"));
            }
            else
            {
            	SFD_DEBUG_PRINT(("NG\r\n"));
            	SFD_DEBUG_PRINT(("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code));
            	return;
            }
            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE;
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_FINALIZE: /* finalize */
            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED;
            break;
        default:
            break;
    }
    return;
}

static void update_dataflash_data_mirror_from_image(void)
{
	flash_interrupt_config_t cb_func_info;
    static uint32_t required_dataflash_block_num;
    flash_err_t flash_error_code = FLASH_SUCCESS;

    switch(update_data_flash_control_block.status)
    {
    	case SFD_DATA_FLASH_UPDATE_STATE_INITIALIZE: /* initialize */
    		cb_func_info.pcallback = update_data_flash_callback_function;
    		cb_func_info.int_priority = 15;
    		R_FLASH_Control(FLASH_CMD_SET_BGO_CALLBACK, (void *)&cb_func_info);
            required_dataflash_block_num = sizeof(SFD_CONTROL_BLOCK) / FLASH_DF_BLOCK_SIZE;
            if(sizeof(SFD_CONTROL_BLOCK) % FLASH_DF_BLOCK_SIZE)
            {
                required_dataflash_block_num++;
            }

            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_ERASE;
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_ERASE:
            SFD_DEBUG_PRINT(("erase dataflash(mirror)..."));
            R_BSP_InterruptsDisable();
            flash_error_code = R_FLASH_Erase((flash_block_address_t)&sfd_control_block_data_mirror, required_dataflash_block_num);
            R_BSP_InterruptsEnable();
            if(FLASH_SUCCESS == flash_error_code)
            {
                SFD_DEBUG_PRINT(("OK\r\n"));
            }
            else
            {
                SFD_DEBUG_PRINT(("NG\r\n"));
                SFD_DEBUG_PRINT(("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code));
                return;
            }

            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE;
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_WRITE:
            SFD_DEBUG_PRINT(("write dataflash(mirror)..."));
            R_BSP_InterruptsDisable();
            flash_error_code = R_FLASH_Write((flash_block_address_t)&sfd_control_block_data_image, (flash_block_address_t)&sfd_control_block_data_mirror, FLASH_DF_BLOCK_SIZE * required_dataflash_block_num);
            R_BSP_InterruptsEnable();
            if(FLASH_SUCCESS == flash_error_code)
            {
                SFD_DEBUG_PRINT(("OK\r\n"));
            }
            else
            {
                SFD_DEBUG_PRINT(("NG\r\n"));
                SFD_DEBUG_PRINT(("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code));
                return;
            }
            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE;
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_FINALIZE: /* finalize */

            if(!memcmp(&sfd_control_block_data, &sfd_control_block_data_mirror, sizeof(SFD_CONTROL_BLOCK)))
            {
                SFD_DEBUG_PRINT(("data flash setting OK.\r\n"));
            }
            else
            {
                SFD_DEBUG_PRINT(("data flash setting NG.\r\n"));
                return;
            }
            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED;
            break;
        default:
    	    break;
    }
    return;
}

static void check_dataflash_area(uint32_t retry_counter)
{
    uint8_t hash_sha256[SFD_SHA256_LENGTH];
#if defined USE_MBEDTLS
    mbedtls_sha256_context ctx;
#elif  defined USE_TINYCRYPT
    TCSha256State_t s;
    struct tc_sha256_state_struct tc_sha256_state;
    s = &tc_sha256_state;
#endif

