vinh107108/amazon-freertos/vendors/renesas/boards/rx65n-rsk/aws_demos/application_code/renesas_code/utility/r_simple_filesystem_on_dataflash.c
#if defined USE_MBEDTLS
    mbedtls_sha256_init(&ctx);
#elif  defined USE_TINYCRYPT
    tc_sha256_init(s);
#endif

    if(retry_counter)
    {
        SFD_DEBUG_PRINT(("recover retry count = %d.\r\n", retry_counter));
        if(retry_counter == MAX_CHECK_DATAFLASH_AREA_RETRY_COUNT)
        {
            SFD_DEBUG_PRINT(("retry over the limit.\r\n"));
            while(1);
        }
    }
    SFD_DEBUG_PRINT(("data flash(main) hash check..."));
#if defined USE_MBEDTLS
    mbedtls_sha256_starts_ret(&ctx, 0); /* 0 means SHA256 context */
    mbedtls_sha256_update_ret(&ctx, (unsigned char *)&sfd_control_block_data.data, sizeof(sfd_control_block_data.data));
    mbedtls_sha256_finish_ret(&ctx, hash_sha256);
#elif  defined USE_TINYCRYPT
    tc_sha256_init(s);
    tc_sha256_update(s, (unsigned char *)&sfd_control_block_data.data, sizeof(sfd_control_block_data.data));
    tc_sha256_final(hash_sha256, s);
#endif
    if(!memcmp(sfd_control_block_data.hash_sha256, hash_sha256, sizeof(hash_sha256)))
    {
        SFD_DEBUG_PRINT(("OK\r\n"));
        SFD_DEBUG_PRINT(("data flash(mirror) hash check..."));
#if defined USE_MBEDTLS
        mbedtls_sha256_starts_ret(&ctx, 0); /* 0 means SHA256 context */
        mbedtls_sha256_update_ret(&ctx, (unsigned char *)&sfd_control_block_data_mirror.data, sizeof(sfd_control_block_data_mirror.data));
        mbedtls_sha256_finish_ret(&ctx, hash_sha256);
#elif  defined USE_TINYCRYPT
        tc_sha256_init(s);
        tc_sha256_update(s, (unsigned char *)&sfd_control_block_data_mirror.data, sizeof(sfd_control_block_data_mirror.data));
        tc_sha256_final(hash_sha256, s);
#endif
        if(!memcmp(sfd_control_block_data_mirror.hash_sha256, hash_sha256, sizeof(hash_sha256)))
        {
            SFD_DEBUG_PRINT(("OK\r\n"));
        }
        else
        {
            SFD_DEBUG_PRINT(("NG\r\n"));
            SFD_DEBUG_PRINT(("recover mirror from main.\r\n"));
            memcpy(&sfd_control_block_data_image, (void *)&sfd_control_block_data, sizeof(sfd_control_block_data));

            data_flash_update_status_initialize();
            while ( update_data_flash_control_block.status < SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED )
            {
                update_dataflash_data_mirror_from_image();
            }
            if (update_data_flash_control_block.status == SFD_DATA_FLASH_UPDATE_STATE_ERROR)
            {
                SFD_DEBUG_PRINT(("ERROR: Update data flash data mirror from image\r\n"));
                while(1);
            }
            check_dataflash_area(retry_counter + 1);
        }
    }
    else
    {
        SFD_DEBUG_PRINT(("NG\r\n"));
        SFD_DEBUG_PRINT(("data flash(mirror) hash check..."));
#if defined USE_MBEDTLS
        mbedtls_sha256_starts_ret(&ctx, 0); /* 0 means SHA256 context */
        mbedtls_sha256_update_ret(&ctx, (unsigned char *)&sfd_control_block_data_mirror.data, sizeof(sfd_control_block_data_mirror.data));
        mbedtls_sha256_finish_ret(&ctx, hash_sha256);
#elif  defined USE_TINYCRYPT
        tc_sha256_init(s);
        tc_sha256_update(s, (unsigned char *)&sfd_control_block_data_mirror.data, sizeof(sfd_control_block_data_mirror.data));
        tc_sha256_final(hash_sha256, s);
#endif
        if(!memcmp(sfd_control_block_data_mirror.hash_sha256, hash_sha256, sizeof(hash_sha256)))
        {
            SFD_DEBUG_PRINT(("OK\r\n"));
            SFD_DEBUG_PRINT(("recover main from mirror.\r\n"));
            memcpy(&sfd_control_block_data_image, (void *)&sfd_control_block_data_mirror, sizeof(sfd_control_block_data_mirror));
            data_flash_update_status_initialize();
            while ( update_data_flash_control_block.status < SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED )
            {
                update_dataflash_data_from_image();
            }
            if (update_data_flash_control_block.status == SFD_DATA_FLASH_UPDATE_STATE_ERROR)
            {
                SFD_DEBUG_PRINT(("ERROR: Update data flash data from image\r\n"));
                while(1);
            }
            check_dataflash_area(retry_counter + 1);
        }
        else
        {
            SFD_DEBUG_PRINT(("NG\r\n"));
			SFD_DEBUG_PRINT(("------------------------------------------------\r\n"));
			SFD_DEBUG_PRINT(("Data flash is completely broken.\r\n"));
			SFD_DEBUG_PRINT(("Initializing Data Flash data to all zero.\r\n"));
			SFD_DEBUG_PRINT(("------------------------------------------------\r\n"));

			memset(&sfd_control_block_data_image.data, 0, sizeof(sfd_control_block_data_image.data));
#if defined USE_MBEDTLS
	        mbedtls_sha256_starts_ret(&ctx, 0); /* 0 means SHA256 context */
	        mbedtls_sha256_update_ret(&ctx, (unsigned char *)&sfd_control_block_data_image.data, sizeof(sfd_control_block_data_image.data));
	        mbedtls_sha256_finish_ret(&ctx, sfd_control_block_data_image.hash_sha256);
#elif  defined USE_TINYCRYPT
	        tc_sha256_init(s);
	        tc_sha256_update(s, (unsigned char *)&sfd_control_block_data_image.data, sizeof(sfd_control_block_data_mirror.data));
	        tc_sha256_final(hash_sha256, s);
#endif
	        data_flash_update_status_initialize();
            while ( update_data_flash_control_block.status < SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED )
            {
                update_dataflash_data_from_image();
            }
            data_flash_update_status_initialize();
            while ( update_data_flash_control_block.status < SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED )
            {
                update_dataflash_data_mirror_from_image();
            }
            check_dataflash_area(0);
        }
    }
}

static void data_flash_update_status_initialize(void)
{
	update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_INITIALIZE;
}

void update_data_flash_callback_function(void *event)
{
	uint32_t event_code;
	event_code = *((uint32_t*)event);

	switch(event_code)
	{
		case FLASH_INT_EVENT_ERASE_COMPLETE:
			if(SFD_DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE == update_data_flash_control_block.status)
			{
				update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_WRITE;
			}
			else
			{
				update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_ERROR;
			}
			break;
		case FLASH_INT_EVENT_WRITE_COMPLETE:
			if(SFD_DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE == update_data_flash_control_block.status)
			{

				update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_FINALIZE;
			}
			else
			{
				update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_ERROR;
			}
			break;
		default:
			break;
	}
}
